In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame(
        {"a" : [4 ,5, 6],
        "b" : [7, 8, 9],
        "c" : [10, 11, 12]},
        index = [1, 2, 3])

In [3]:
df

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12

In [5]:
# df[['a','b']]
# df.loc[3,"a"] => 6

   a  b
1  4  7
2  5  8
3  6  9

In [6]:
df.loc[[1,2],["a","b"]]

   a  b
1  4  7
2  5  8

In [7]:
df = pd.DataFrame(
        [[4, 7, 10],
        [5, 8, 11],
        [6, 9, 12]],
        index=[1, 2, 3],
        columns=['a', 'b', 'c'])
df

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12

In [43]:
import numpy as np
df = pd.DataFrame(
    {"a" : [4 ,5, 6, 6, np.nan],
    "b" : [7, 8, np.nan, 9, 9],
    "c" : [10, 11, 12, np.nan, 12]},
    index = pd.MultiIndex.from_tuples(
    [('d',1),('d',2),('e',2),('e',3),('e',4)],
    names=['n','v']))
df

       a    b     c
n v
d 1  4.0  7.0  10.0
  2  5.0  8.0  11.0
e 2  6.0  NaN  12.0
  3  6.0  9.0   NaN
  4  NaN  9.0  12.0

In [26]:
# df[df.b > 7]
df[df['c'] >= 7]

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12
  3  6  9  12

In [29]:
df.drop_duplicates?

Signature: df.drop_duplicates(subset=None, keep='first', inplace=False)
Docstring:
Return DataFrame with duplicate rows removed, optionally only
considering certain columns.

Parameters
----------
subset : column label or sequence of labels, optional
    Only consider certain columns for identifying duplicates, by
    default use all of the columns
keep : {'first', 'last', False}, default 'first'
    - ``first`` : Drop duplicates except for the first occurrence.
    - ``last`` : Drop duplicates except for the last occurrence.
    - False : Drop all duplicates.
inplace : boolean, default False
    Whether to drop duplicates in place or to return a copy

Returns
-------
deduplicated : DataFrame
File:      /anaconda3/lib/python3.7/site-packages/pandas/core/frame.py
Type:      method

In [32]:
df=df.drop_duplicates(keep='last')
df

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 3  6  9  12

In [35]:
df[df["b"] != 7]

     a  b   c
n v
d 2  5  8  11
e 3  6  9  12

In [40]:
df['a'].isin([5])

n  v
d  1    False
   2     True
e  3    False
Name: a, dtype: bool

In [44]:
pd.isnull(df)

         a      b      c
n v
d 1  False  False  False
  2  False  False  False
e 2  False   True  False
  3  False  False   True
  4   True  False  False

In [46]:
df['a'].isnull().sum()

1

In [47]:
pd.notnull(df)

         a      b      c
n v
d 1   True   True   True
  2   True   True   True
e 2   True  False   True
  3   True   True  False
  4  False   True   True

In [49]:
df.notnull().sum()

a    4
b    4
c    4
dtype: int64

In [50]:
df.a.notnull()

n  v
d  1     True
   2     True
e  2     True
   3     True
   4    False
Name: a, dtype: bool

* &,|,~,^,df.any(),df.all() L
* and, or, not, xor, any, all

In [68]:
# ~df.a.notnull()
df[df.b == 7] & df[df.a == 5]

      a   b   c
n v
d 1 NaN NaN NaN
  2 NaN NaN NaN

In [73]:
df.head(2)

       a    b     c
n v
d 1  4.0  7.0  10.0
  2  5.0  8.0  11.0

In [85]:
df.sample(frac=0.3)

       a    b     c
n v
d 2  5.0  8.0  11.0
e 3  6.0  9.0   NaN

In [91]:
df.sample(n=3)

       a    b     c
n v
e 4  NaN  9.0  12.0
d 1  4.0  7.0  10.0
e 3  6.0  9.0   NaN

In [99]:
df.iloc[-2:]

       a    b     c
n v
e 3  6.0  9.0   NaN
  4  NaN  9.0  12.0

In [102]:
df=pd.DataFrame({'a': [1,10,8,11,-1],
                'b': list('abcde'),
                'c': [1.0,2.0,np.nan,3.0,4.0]})
df

    a  b    c
0   1  a  1.0
1  10  b  2.0
2   8  c  NaN
3  11  d  3.0
4  -1  e  4.0

In [107]:
df.nlargest(3, 'a')

    a  b    c
3  11  d  3.0
1  10  b  2.0
2   8  c  NaN

In [108]:
df.nsmallest(1, 'a')

   a  b    c
4 -1  e  4.0